In [1]:
import pandas as pd
import numpy as np

In [2]:
players = pd.read_csv('input/players.csv')

In [3]:
salaries = pd.read_csv('input/salaries.csv')

In [4]:
salaries = salaries.drop(['Unnamed: 0'], axis=1)

In [5]:
salaries

                 equipo            nombre      salarios
0         atlanta-hawks       Evan Turner  18.606.557 $
1         atlanta-hawks     Jabari Parker   6.500.000 $
2         atlanta-hawks  Chandler Parsons  25.102.511 $
3         atlanta-hawks   Cameron Reddish   4.245.720 $
4         atlanta-hawks      Damian Jones   2.305.057 $
..                  ...               ...           ...
524  washington-wizards    Jemerrio Jones   1.416.852 $
525  washington-wizards      Jordan McRae   1.645.357 $
526  washington-wizards        Phil Booth     898.310 $
527  washington-wizards   Justin Robinson     838.464 $
528  washington-wizards  Garrison Mathews   Ambivalente

[529 rows x 3 columns]

In [6]:
lst = ['Agente Libre', 'AL Restringido', 'Ambivalente']
for i in lst:
    salaries.loc[salaries['salarios'] == i] = '0 $'

In [7]:
salaries.salarios.unique()

array(['18.606.557 $', '6.500.000 $', '25.102.511 $', '4.245.720 $',
       '2.305.057 $', '2.636.280 $', '18.500.000 $', '2.686.560 $',
       '2.603.982 $', '6.273.120 $', '7.068.360 $', '4.353.659 $',
       '1.566.666 $', '1.445.697 $', '1.620.564 $', '898.310 $', '0 $',
       '32.700.690 $', '32.742.000 $', '4.878.049 $', '7.830.000 $',
       '1.937.520 $', '6.534.829 $', '12.553.471 $', '4.767.000 $',
       '1.663.861 $', '1.618.520 $', '3.458.400 $', '2.379.840 $',
       '3.481.986 $', '38.199.000 $', '9.302.326 $', '7.667.000 $',
       '1.911.600 $', '2.376.840 $', '2.625.718 $', '10.605.600 $',
       '1.699.236 $', '1.678.854 $', '17.000.000 $', '25.565.217 $',
       '15.006.250 $', '13.000.000 $', '14.471.910 $', '20.253.968 $',
       '3.831.840 $', '4.028.400 $', '3.755.400 $', '1.416.852 $',
       '1.557.250 $', '838.464 $', '13.015.873 $', '2.529.684 $',
       '8.156.500 $', '27.250.575 $', '5.348.007 $', '5.300.400 $',
       '5.201.400 $', '19.046.512 $', '10.000.000 $', '3.377.569 $',
       '2.332.320 $', '3.000.000 $', '1.588.231 $', '2.250.000 $',
       '6.400.920 $', '28.942.830 $', '10.482.396 $', '18.539.130 $',
       '1.290.960 $', '13.437.500 $', '15.643.750 $', '2.907.143 $',
       '4.764.960 $', '2.281.800 $', '12.727.273 $', '2.035.800 $',
       '9.607.500 $', '3.280.920 $', '18.150.000 $', '10.259.375 $',
       '7.441.860 $', '7.683.360 $', '27.285.000 $', '12.759.670 $',
       '7.812.500 $', '3.500.000 $', '3.703.704 $', '9.473.684 $',
       '1.500.000 $', '30.500.000 $', '14.041.096 $', '9.000.000 $',
       '3.389.400 $', '2.000.000 $', '26.573.595 $', '13.017.857 $',
       '4.444.746 $', '17.839.286 $', '3.321.030 $', '2.731.714 $',
       '34.234.964 $', '27.093.019 $', '18.086.957 $', '11.392.857 $',
       '7.333.333 $', '7.317.073 $', '3.569.643 $', '3.623.000 $',
       '3.827.160 $', '3.285.120 $', '1.645.357 $', '40.231.758 $',
       '1.964.760 $', '2.200.000 $', '4.629.630 $', '1.897.800 $',
       '1.882.867 $', '1.925.880 $', '38.150.000 $', '38.506.482 $',
       '14.057.730 $', '8.349.039 $', '2.174.318 $', '16.758.621 $',
       '2.028.594 $', '3.492.063 $', '21.000.000 $', '19.767.442 $',
       '10.810.000 $', '18.000.000 $', '3.529.555 $', '2.813.280 $',
       '2.007.514 $', '2.816.760 $', '32.852.753 $', '5.000.000 $',
       '11.511.236 $', '6.000.000 $', '1.995.120 $', '8.000.000 $',
       '7.000.000 $', '12.345.679 $', '3.567.720 $', '1.977.000 $',
       '2.331.593 $', '37.436.858 $', '4.100.000 $', '15.000.000 $',
       '2.564.753 $', '1.974.600 $', '7.815.533 $', '12.500.000 $',
       '16.111.111 $', '2.625.000 $', '6.927.480 $', '9.073.050 $',
       '2.429.400 $', '8.730.240 $', '13.248.243 $', '17.185.185 $',
       '2.478.840 $', '1.845.301 $', '7.059.480 $', '9.250.000 $',
       '19.217.900 $', '15.349.400 $', '12.100.000 $', '11.667.886 $',
       '3.454.080 $', '11.286.517 $', '3.640.200 $', '25.842.697 $',
       '15.625.000 $', '30.689.655 $', '2.905.800 $', '9.206.349 $',
       '2.961.120 $', '1.723.050 $', '12.093.023 $', '11.301.219 $',
       '19.000.000 $', '16.229.213 $', '27.270.000 $', '27.250.000 $',
       '2.530.680 $', '3.650.794 $', '5.813.640 $', '1.400.000 $',
       '26.866.111 $', '8.719.320 $', '12.926.829 $', '9.757.440 $',
       '3.902.439 $', '8.664.928 $', '4.862.040 $', '1.934.160 $',
       '16.000.000 $', '7.265.485 $', '7.125.000 $', '1.702.486 $',
       '2.964.840 $', '20.000.000 $', '9.756.098 $', '4.463.640 $',
       '15.500.000 $', '3.551.100 $', '4.380.120 $', '4.855.800 $',
       '1.600.000 $', '7.804.878 $', '7.839.960 $', '38.328.211 $',
       '22.615.559 $', '10.740.740 $', '2.284.800 $', '2.475.840 $',
       '3.952.920 $', '22.321.429 $', '7.250.000 $', '9.745.200 $',
       '9.258.000 $', '20.250.000 $', '5.806.440 $', '5.697.600 $',
       '22.558.140 $', '10.125.000 $', '31.034.483 $', '8.113.930 $',
       '27.504.630 $', '2.582.160 $', '3.058.800 $', '4.780.488 $',
       '19.631.975 $', '5.453.280 $', '4.033.440 $', '2.193.480 $',
       '9.481.320 $', '16.190.476 $', '4.161.000 $', '29.802.321 $',
       '27.556.959 $', '19.269.662 $', '2.105.520 $', '4.240.200 $',
       '12.000.000 $', '2.149.560 $', '1.737.145 $', '2.338.847 $',
       '18.973.214 $', '12.195.122 $', '8.529.386 $', '11.746.032 $',
       '8.556.120 $', '6.392.760 $', '12.698.413 $', '4.861.208 $',
       '6.825.000 $', '3.150.000 $', '2.578.800 $', '2.033.160 $',
       '26.000.000 $', '27.739.975 $', '2.689.920 $', '13.285.714 $',
       '3.754.886 $', '2.760.480 $', '1.948.080 $', '5.500.000 $',
       '2.875.000 $', '1.676.735 $', '1.950.600 $', '33.296.296 $',
       '23.271.605 $', '25.595.700 $', '9.279.900 $', '10.116.576 $',
       '2.351.839 $', '4.000.000 $', '25.008.427 $', '16.976.744 $',
       '11.954.546 $', '32.511.623 $', '11.000.000 $', '3.635.760 $',
       '1.962.360 $', '15.450.051 $', '5.853.659 $', '3.219.480 $',
       '4.469.160 $', '7.936.508 $', '8.730.159 $'], dtype=object)

In [8]:
for i,element in enumerate(salaries.salarios):
    salaries.salarios[i] = element[:-2]

In [9]:
for i,element in enumerate(salaries.salarios):
    salaries.salarios[i] = element.replace('.','')

In [10]:
salaries

                 equipo            nombre  salarios
0         atlanta-hawks       Evan Turner  18606557
1         atlanta-hawks     Jabari Parker   6500000
2         atlanta-hawks  Chandler Parsons  25102511
3         atlanta-hawks   Cameron Reddish   4245720
4         atlanta-hawks      Damian Jones   2305057
..                  ...               ...       ...
524  washington-wizards    Jemerrio Jones   1416852
525  washington-wizards      Jordan McRae   1645357
526  washington-wizards        Phil Booth    898310
527  washington-wizards   Justin Robinson    838464
528                 0 $               0 $         0

[529 rows x 3 columns]

In [11]:
salaries['salarios'] = salaries['salarios'].astype('int64')

In [12]:
salaries.dtypes

equipo      object
nombre      object
salarios     int64
dtype: object

In [13]:
salaries = salaries.sort_values('salarios', ascending=False)

In [14]:
games = pd.read_csv('input/games.csv')
players = pd.read_csv('input/players.csv')
details = pd.read_csv('input/games_details.csv')

In [15]:
details = details[['GAME_ID','PLAYER_NAME','TEAM_ID']]

In [16]:
games.head()

,GAME_DATE_EST,GAME_ID,GAME_STATUS_TEXT,HOME_TEAM_ID,VISITOR_TEAM_ID,SEASON,TEAM_ID_home,PTS_home,FG_PCT_home,FT_PCT_home,...,AST_home,REB_home,TEAM_ID_away,PTS_away,FG_PCT_away,FT_PCT_away,FG3_PCT_away,AST_away,REB_away,HOME_TEAM_WINS
0,2020-03-01,21900895,Final,1610612766,1610612749,2019,1610612766,85.0,0.354,0.900,...,22.0,47.0,1610612749,93.0,0.402,0.762,0.226,20.0,61.0,0
1,2020-03-01,21900896,Final,1610612750,1610612742,2019,1610612750,91.0,0.364,0.400,...,19.0,57.0,1610612742,111.0,0.468,0.632,0.275,28.0,56.0,0
2,2020-03-01,21900897,Final,1610612746,1610612755,2019,1610612746,136.0,0.592,0.805,...,25.0,37.0,1610612755,130.0,0.505,0.650,0.488,27.0,37.0,1
3,2020-03-01,21900898,Final,1610612743,1610612761,2019,1610612743,133.0,0.566,0.700,...,38.0,41.0,1610612761,118.0,0.461,0.897,0.263,24.0,36.0,1
4,2020-03-01,21900899,Final,1610612758,1610612765,2019,1610612758,106.0,0.407,0.885,...,18.0,51.0,1610612765,100.0,0.413,0.667,0.429,23.0,42.0,1

In [17]:
salaries

                    equipo             nombre  salarios
160  golden-state-warriors      Stephen Curry  40231758
179        houston-rockets  Russell Westbrook  38506482
354  oklahoma-city-thunder         Chris Paul  38328211
38           brooklyn-nets       Kevin Durant  38199000
178        houston-rockets       James Harden  38150000
..                     ...                ...       ...
88                     0 $                0 $         0
474                    0 $                0 $         0
265                    0 $                0 $         0
211                    0 $                0 $         0
528                    0 $                0 $         0

[529 rows x 3 columns]

In [18]:
a = salaries.loc[salaries['salarios'] == 0]

In [19]:
a.index

Int64Index([140, 141, 124, 517,  35, 177, 317, 405, 423, 387, 369,  52, 438,
             70, 316, 180, 456,  17,  87,  88, 474, 265, 211, 528],
           dtype='int64')

In [20]:
salaries = salaries.drop([140, 141, 124, 517,  35, 177, 317, 405, 423, 387, 369,  52, 438,
             70, 316, 180, 456,  17,  87,  88, 474, 265, 211, 528],axis=0)

In [21]:
salaries

                    equipo                  nombre  salarios
160  golden-state-warriors           Stephen Curry  40231758
179        houston-rockets       Russell Westbrook  38506482
354  oklahoma-city-thunder              Chris Paul  38328211
38           brooklyn-nets            Kevin Durant  38199000
178        houston-rockets            James Harden  38150000
..                     ...                     ...       ...
192        houston-rockets  William McDowell-White    838464
242     los Angeles-lakers         Jordan Caroline    838464
236     los Angeles-lakers          Devontae Cacok    838464
351        new-york-knicks             Amir Hinton    838464
331   new-orleans-pelicans             Jalen Adams    838464

[505 rows x 3 columns]

In [22]:
byTeams = pd.pivot_table(salaries, index=['equipo', 'nombre'])

In [23]:
byTeams

                                    salarios
equipo             nombre
atlanta-hawks      Alex Len          4353659
                   Allen Crabbe     18500000
                   Armoni Brooks      898310
                   Bruno Fernando    1566666
                   Cameron Reddish   4245720
...                                      ...
washington-wizards Justin Robinson    838464
                   Phil Booth         898310
                   Rui Hachimura     4469160
                   Thomas Bryant     7936508
                   Troy Brown        3219480

[505 rows x 1 columns]

In [24]:
teams =['atlanta-hawks', 
        'boston-celtics', 
        'brooklyn-nets', 
        'charlotte-hornets', 
        'chicago-bulls', 
        'cleveland-cavaliers', 
        'dallas-mavericks', 
        'denver-nuggets', 
        'detroit-pistons', 
        'golden-state-warriors', 
        'houston-rockets', 
        'indiana-pacers', 
        'los-angeles-clippers', 
        'los Angeles-lakers', 
        'memphis-grizzlies', 
        'miami-heat', 
        'milwaukee-bucks',
        'minnesota-timberwolves',
        'new-orleans-pelicans',
        'new-york-knicks',
        'oklahoma-city-thunder',
        'orlando-magic',
        'philadelphia-76ers',
        'phoenix-suns',
        'portland-trail-blazers',
        'sacramento-kings',
        'san-antonio-spurs', 
        'toronto-raptors', 
        'utah-jazz', 
        'washington-wizards']

In [25]:
TopSalaries = byTeams.loc['atlanta-hawks'].sort_values('salarios', ascending=False)[:5]

In [26]:
for i in teams:
    team = byTeams.loc[i].sort_values('salarios', ascending=False)[:5]
    TopSalaries = TopSalaries.append(team)

In [27]:
TopSalaries.reset_index(inplace=True)

In [28]:
TopSalaries = TopSalaries.drop_duplicates()

In [29]:
TopSalaries = TopSalaries.rename(columns ={'nombre': 'PLAYER_NAME'})

In [30]:
TopSalaries.head(10)

         PLAYER_NAME  salarios
0   Chandler Parsons  25102511
1        Evan Turner  18606557
2       Allen Crabbe  18500000
3    De'Andre Hunter   7068360
4      Jabari Parker   6500000
10      Kemba Walker  32742000
11    Gordon Hayward  32700690
12      Marcus Smart  12553471
13      Jayson Tatum   7830000
14      Jaylen Brown   6534829

In [31]:
details

         GAME_ID            PLAYER_NAME     TEAM_ID
0       21900895        Wesley Matthews  1610612749
1       21900895  Giannis Antetokounmpo  1610612749
2       21900895            Brook Lopez  1610612749
3       21900895       Donte DiVincenzo  1610612749
4       21900895           Eric Bledsoe  1610612749
...          ...                    ...         ...
576777  11200005        Jordan Hamilton  1610612743
576778  11200005         Kenneth Faried  1610612743
576779  11200005           Kosta Koufos  1610612743
576780  11200005         Timofey Mozgov  1610612743
576781  11200005              Ty Lawson  1610612743

[576782 rows x 3 columns]

In [32]:
withPlayers = details.merge(right=TopSalaries, on=['PLAYER_NAME'])
withPlayers.to_csv('input/gameWithPlayers.csv')

In [33]:
withPlayers

        GAME_ID            PLAYER_NAME     TEAM_ID  salarios
0      21900895  Giannis Antetokounmpo  1610612749  25842697
1      21900882  Giannis Antetokounmpo  1610612749  25842697
2      21900858  Giannis Antetokounmpo  1610612749  25842697
3      21900851  Giannis Antetokounmpo  1610612749  25842697
4      21900840  Giannis Antetokounmpo  1610612749  25842697
...         ...                    ...         ...       ...
93169  11300088         Andre Roberson  1610612760  10740740
93170  11300082         Andre Roberson  1610612760  10740740
93171  11300066         Andre Roberson  1610612760  10740740
93172  11300054         Andre Roberson  1610612760  10740740
93173  11300021         Andre Roberson  1610612760  10740740

[93174 rows x 4 columns]

In [34]:
games = pd.read_csv('input/games.csv')

In [35]:
total = games.merge(right=withPlayers, on=['GAME_ID'])

In [36]:
total = total[['GAME_ID','TEAM_ID','HOME_TEAM_ID','SEASON', 'VISITOR_TEAM_ID', 'PLAYER_NAME', 'salarios']]

In [37]:
total = total[total['SEASON']>=2019]

In [38]:
total

,GAME_ID,TEAM_ID,HOME_TEAM_ID,SEASON,VISITOR_TEAM_ID,PLAYER_NAME,salarios
0,21900895,1610612749,1610612766,2019,1610612749,Giannis Antetokounmpo,25842697
1,21900895,1610612749,1610612766,2019,1610612749,Brook Lopez,12093023
2,21900895,1610612749,1610612766,2019,1610612749,Eric Bledsoe,15625000
3,21900895,1610612749,1610612766,2019,1610612749,Marvin Williams,15006250
4,21900895,1610612749,1610612766,2019,1610612749,George Hill,9206349
...,...,...,...,...,...,...,...
39269,11900003,1610612754,1610612758,2019,1610612754,Victor Oladipo,21000000
39270,11900003,1610612754,1610612758,2019,1610612754,Malcolm Brogdon,19767442
39271,11900003,1610612758,1610612758,2019,1610612754,Dewayne Dedmon,12698413
39272,11900003,1610612754,1610612758,2019,1610612754,Jeremy Lamb,10000000
39273,11900003,1610612758,1610612758,2019,1610612754,Marvin Bagley III,8556120

In [39]:
total.to_csv('output/playersPerMatch.csv')

In [40]:
top5 = total[['GAME_ID','TEAM_ID','HOME_TEAM_ID','VISITOR_TEAM_ID']]
top5[:20]

     GAME_ID     TEAM_ID  HOME_TEAM_ID  VISITOR_TEAM_ID
0   21900895  1610612749    1610612766       1610612749
1   21900895  1610612749    1610612766       1610612749
2   21900895  1610612749    1610612766       1610612749
3   21900895  1610612749    1610612766       1610612749
4   21900895  1610612749    1610612766       1610612749
5   21900895  1610612766    1610612766       1610612749
6   21900895  1610612766    1610612766       1610612749
7   21900895  1610612766    1610612766       1610612749
8   21900895  1610612766    1610612766       1610612749
9   21900896  1610612742    1610612750       1610612742
10  21900896  1610612742    1610612750       1610612742
11  21900896  1610612742    1610612750       1610612742
12  21900896  1610612750    1610612750       1610612742
13  21900896  1610612750    1610612750       1610612742
14  21900896  1610612750    1610612750       1610612742
15  21900897  1610612755    1610612746       1610612755
16  21900897  1610612755    1610612746       1610612755
17  21900897  1610612755    1610612746       1610612755
18  21900897  1610612746    1610612746       1610612755
19  21900897  1610612746    1610612746       1610612755

In [41]:
top5order=pd.crosstab(index=top5['GAME_ID'], columns=top5['TEAM_ID']==top5['HOME_TEAM_ID'])

In [42]:
top5order.head()

col_0     False  True
GAME_ID
11900002      4      5
11900003      4      5
11900005      5      4
11900006      5      5
11900007      5      2

In [43]:
top5order=top5order.reset_index()

In [44]:
top5order

col_0   GAME_ID  False  True
0      11900002      4     5
1      11900003      4     5
2      11900005      5     4
3      11900006      5     5
4      11900007      5     2
..          ...    ...   ...
960    21900897      3     5
961    21900898      3     4
962    21900899      3     4
963    21900900      5     5
964    21900901      3     3

[965 rows x 3 columns]

In [45]:
top5order.columns

Index(['GAME_ID', False, True], dtype='object', name='col_0')

In [46]:
top5order = top5order.rename(columns={False:'VISITOR_TEAM_ID',True:'HOME_TEAM_ID'})

In [47]:
top5order

col_0   GAME_ID  VISITOR_TEAM_ID  HOME_TEAM_ID
0      11900002                4             5
1      11900003                4             5
2      11900005                5             4
3      11900006                5             5
4      11900007                5             2
..          ...              ...           ...
960    21900897                3             5
961    21900898                3             4
962    21900899                3             4
963    21900900                5             5
964    21900901                3             3

[965 rows x 3 columns]

In [48]:
top5order.to_csv('output/top5players.csv')